Feature: Работа с коллекциями
   Background:
     Given Пользователь авторизовался на сайте

  @hooks
  @close
  Scenario: Создание коллекции
    When я нажимаю кнопку Каталог
    And я нажимаю кнопку Коллекции
    And я нажимаю кнопку Создать
    And я ввожу название коллекции
    And я нажимаю кнопку создания коллекции
    Then появляется сообщение

  Scenario: Удаление коллекции
    When я нажимаю кнопку Каталог
    And я нажимаю кнопку Коллекции
    And я выбира в выпадающем меню у коллекции Удалить
    And я подтверждаю удаление
    Then появляется сообщение